---
kind: method
id: M:Autodesk.Revit.DB.GroupNode.GetTransform
source: html/13e9ba28-e94a-c79f-689c-4367883d62bd.htm
---
# Autodesk.Revit.DB.GroupNode.GetTransform Method

A transformation matrix associated with the node.

## Syntax (C#)
```csharp
public Transform GetTransform()
```